In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame()

In [15]:
df

Empty DataFrame
Columns: []
Index: []

In [4]:
print(df)

Empty DataFrame
Columns: []
Index: []

In [5]:
df1 = pd.DataFrame([[1,2,3,5], [6,8,3,5], [6,5,7,8], [32,12,0,34], [12,34,56,78]])
df1

    0   1   2   3
0   1   2   3   5
1   6   8   3   5
2   6   5   7   8
3  32  12   0  34
4  12  34  56  78

In [7]:
df1.head(3)

   0  1  2  3
0  1  2  3  5
1  6  8  3  5
2  6  5  7  8

In [8]:
df1.tail(2)

    0   1   2   3
3  32  12   0  34
4  12  34  56  78

### Slicing and Adding columns to a DataFrame

In [9]:
df1

    0   1   2   3
0   1   2   3   5
1   6   8   3   5
2   6   5   7   8
3  32  12   0  34
4  12  34  56  78

In [10]:
df1.shape

(5, 4)

In [11]:
df1.iloc[0,1]       # 0th row or 1st column per

2

In [12]:
df1.iloc[0:2, 1:3]

   1  2
0  2  3
1  8  3

In [14]:
# adding columns
df1 = pd.DataFrame([[1,2,3,5], [6,8,3,5], [6,5,7,8], [32,12,0,34], [12,34,56,78]], columns=['A', 'B', 'C', 'D'])
df1

    A   B   C   D
0   1   2   3   5
1   6   8   3   5
2   6   5   7   8
3  32  12   0  34
4  12  34  56  78

### Reading a CSV file

In [18]:
df = pd.read_csv('data.csv')

In [21]:
df.head()

        Date       Open       High        Low      Close   Change       Volume
0  23-Feb-21  31,722.16  31,800.90  31,597.31  31,626.19   -21.38  718,191,025
1  22-Feb-21  31,874.78  31,958.58  31,612.55  31,647.57  -203.61  721,952,658
2  19-Feb-21  31,748.75  31,904.30  31,749.43  31,851.18    91.36  694,795,084
3  18-Feb-21  32,049.85  32,104.67  31,745.72  31,759.82  -288.86  577,837,595
4  17-Feb-21  32,166.21  32,390.77  32,044.01  32,048.68   -93.15  701,658,181

In [24]:
print(df['Open'].dtype)

object

In [27]:
print(df['Volume'].dtype)

object

In [31]:
# change datatype to category
print(df['Open'].astype('category'))

0       31,722.16
1       31,874.78
2       31,748.75
3       32,049.85
4       32,166.21
          ...
3216    10,688.98
3217    10,670.68
3218    10,596.40
3219    10,625.66
3220    10,634.22
Name: Open, Length: 3221, dtype: category
Categories (3213, object): ['10,001.62', '10,025.55', '10,046.55', '10,060.30', ..., '9,970.57', '9,980.22', '9,986.79', '9,998.13']

### Writing a CSV file

In [33]:
df1 = pd.DataFrame([[1,2,3,5], [6,8,3,5], [6,5,7,8], [32,12,0,34], [12,34,56,78]])
df1

    0   1   2   3
0   1   2   3   5
1   6   8   3   5
2   6   5   7   8
3  32  12   0  34
4  12  34  56  78

In [36]:
# converting data to csv file
df1.to_csv('export_data', index=False)

## Merging DataFrames in python

In [44]:
df1 = pd.DataFrame([[3,5,7,8], [7,4,2,1], [4,8,0,0], [34,2,2,45]], columns=['A', 'B', 'C', 'D'])
df1

    A  B  C   D
0   3  5  7   8
1   7  4  2   1
2   4  8  0   0
3  34  2  2  45

In [50]:
df2 = pd.DataFrame([[7,5,8,8], [4,4,7,7], [4,8,5,6], [9,2,9,0]], columns=['W', 'X', 'Y', 'Z'])
df2

   W  X  Y  Z
0  7  5  8  8
1  4  4  7  7
2  4  8  5  6
3  9  2  9  0

In [51]:
# merging
df3 = pd.merge(df1, df2, right_on='X', left_on='B')
df3

    A  B  C   D  W  X  Y  Z
0   3  5  7   8  7  5  8  8
1   7  4  2   1  4  4  7  7
2   4  8  0   0  4  8  5  6
3  34  2  2  45  9  2  9  0